dwijaybane/msp430/Source Files/eusci_uart.c
}

/*****************************************************************//**
* @brief        		Write The String of Data to UART Port Selected.
* @param[in]        	UART Module like uartA0,uartA1 AND String of Data.
* @return           	None
**********************************************************************/
void WriteDataStringUart(UartId_e uartx,char *String)
{
    int i = 0;
	while (String[i] != 0)
	{
		UART_Send(uartx,String[i]);
		Delay_Ms(2);
		i++;
	}
}
#endif

/**********************************************************************//**
* @brief        		Read the single byte of Data from UART Port Selected.
* @param[in]        	UART Module like uartA0,uartA1.
* @return           	Character Received from UART.
***************************************************************************/
char ReadDataUart(UartId_e uartx)
{
	if(uartx==UARTA0)
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A0_BASE,
		                       EUSCI_UART_RECEIVE_INTERRUPT_FLAG)) ;
		return(EUSCI_UART_receiveData(EUSCI_A0_BASE));
	}
	else if(uartx==UARTA1)
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A1_BASE,
				               EUSCI_UART_RECEIVE_INTERRUPT_FLAG)) ;
		return(EUSCI_UART_receiveData(EUSCI_A1_BASE));
	}
	else
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A2_BASE,
				               EUSCI_UART_RECEIVE_INTERRUPT_FLAG)) ;
	    return(EUSCI_UART_receiveData(EUSCI_A2_BASE));
	}
}

/******************************************************************************//**
* @brief        		Display the data of any format on UART Port Selected.
* @param[in]        	UART Module (uartA0,uartA1) , Data you want to Display.
* @return           	Data will be Displayed on Serial PORT TERMINAL .
**********************************************************************************/
char printf(UartId_e uartx,char *format, ...)
{
	char hex[]= "0123456789ABCDEF";
	unsigned int width_dec[10] = { 1, 10, 100, 1000,10000};
	unsigned int width_hex[10] = { 0x1, 0x10, 0x100, 0x1000};
	unsigned int temp;

	char format_flag, fill_char,temp_data;
	unsigned long u_val, div_val;
	unsigned int base;

	char *ptr;
	va_list ap;
	va_start(ap, format);

	for(;;)
	{
		while((format_flag = *format++) != '%')      /* until full format string read */
		{
			if(!format_flag)
			{                        /* until '%' or '\0' */
				return(0);
			}
			UART_Send(uartx,format_flag);
			Delay_Ms(2);
		}
		switch(format_flag = *format++)
		{
			case 'c':
				format_flag = va_arg(ap,int);
				UART_Send(uartx,format_flag);
				Delay_Ms(2);

				continue;

			default:
				UART_Send(uartx,format_flag);
				Delay_Ms(2);

				continue;

			case 'b':
				format_flag = va_arg(ap,int);
				temp_data = (hex[(unsigned int)format_flag >> 4]);
				UART_Send(uartx,temp_data);
				Delay_Ms(2);
				temp_data = (hex[(unsigned int)format_flag & 0x0F]);
				UART_Send(uartx,temp_data);
				Delay_Ms(2);

				continue;

			case 's':
				ptr = va_arg(ap,char *);
				while(*ptr)
				{
					temp_data = (*ptr++);
					UART_Send(uartx,temp_data);
					Delay_Ms(2);
				}

				continue;

			case 'd':
				base = 10;
				if(*format == ' ')
				{
					format_flag = 0;
					//*format++;
				}
				else
				{
					fill_char = *format++;
					format_flag = ( *format++) - '1';

				}
				div_val = width_dec[format_flag];
				u_val = va_arg(ap,int);
				if(((int)u_val) < 0)
				{
					u_val = - u_val;    /* applied to unsigned type, result still unsigned */
					temp = '-';
					UART_Send(uartx,temp);
					Delay_Ms(2);
				}

				goto CONVER_LOOP;

			case 'x':
				base = 16;
				if(*format == ' ')
				{
					format_flag = 0;
					//*format++;
				}
				else
				{
					fill_char = *format++;
					format_flag = ( *format) - '1';
					*format++;
				}
				div_val = width_hex[format_flag];
				u_val = va_arg(ap, int);

CONVER_LOOP:
				while(div_val > 1 && div_val > u_val)
				{
					div_val /= base;
					UART_Send(uartx,fill_char);
					Delay_Ms(2);
				}

				do
				{
					temp_data = (hex[u_val/div_val]);
					UART_Send(uartx,temp_data);
					Delay_Ms(2);
					u_val %= div_val;
					div_val /= base;
				}while(div_val);
			}/* end of switch statement */
		}
		return(0);
}

/******************************************************************************//**
* @brief        		Take a Single character of data from UART Port Selected.
* @param[in]        	UART Module(UARTA0,UARTA1) , TRANSFER BLOCK TYPE.
* @return           	Received Data will be returned to an INT variable.
**********************************************************************************/
int getche(UartId_e uartx,TRANSFER_BLOCK_Type uartm)
{
	unsigned char len[1]={0};
	while(1)
	{
		UART_Recieve(uartx,len,1,uartm);
		while(len[0]>0)
		{
			if (len[0] == ENTER_KEY)
			{
				return(ENTER_KEY);
			}
			else if (len[0] == BACKSPACE_KEY)
			{
				return(BACKSPACE_KEY);
			}
			else if(len[0] == ESC_KEY)
			{
				Esc_Flag = 1;
				return(ESC_KEY);
			}
			else if ((len[0] >= 0x20) && (len[0] <= 0x7F))
			{
				return(len[0]);
			}
		}
	}
}

/***********************************************************************************************//**
* @brief        		Take data of variable length from UART Port Selected.
* @param[in]        	UART Module(UARTA0,UARTA1) , Character Array , LENGTH , TRANSFER BLOCK TYPE.
* @return           	Received Data will be returned to character array.
***************************************************************************************************/
char getline(UartId_e uartx,char *s,unsigned int length,TRANSFER_BLOCK_Type uartm)
{
	unsigned int j = 0,temp;
	unsigned int getline_data;
	while(1)
	{
		getline_data = getche(uartx,uartm);
		if(j < length)
		{
			if(getline_data == BACKSPACE_KEY)
			{
				temp = BACKSPACE_KEY;
				printf(UARTA1,"%c",temp);
				temp = ' ';
				printf(UARTA1,"%c",temp);
				temp = BACKSPACE_KEY;
				printf(UARTA1,"%c",temp);
				j--;
			}
			else if(getline_data == ENTER_KEY)
			{
				return j;
			}
			else if((getline_data >= ' ') && (getline_data <= 0x7F))
			{
				s[j] = getline_data;
				UART_Send(UARTA1,s[j]);
				j++;
			}
		}
		else
		{
			UART_Send(uartx,BELL_KEY);
			if(getline_data == ENTER_KEY)
			{
				return j;
			}
			j++;
		}
	}
}

/***********************************************************************************************//**
* @brief        		Take data of variable length of HEX format from UART Port Selected.
* @param[in]        	UART Module(UARTA0,UARTA1) , Character Array , LENGTH , TRANSFER BLOCK TYPE.
* @return           	Received Data will be returned in HEX format to character array.
***************************************************************************************************/
unsigned int getline_hex(UartId_e uartx,char s[10],unsigned int length,TRANSFER_BLOCK_Type uartm)
{
	unsigned char dummy[10]={0};
	unsigned int j = 0,temp,str_ad=0,i,b=0,c=0,k;
	unsigned int getline_data;
	while(1)
	{
		getline_data = getche(uartx,uartm);
		if(getline_data == BACKSPACE_KEY)
		{
			if(j>0)
			{
				temp = BACKSPACE_KEY;
				printf(UARTA1,"%c",temp);
				temp = ' ';
				printf(UARTA1,"%c",temp);
				temp = BACKSPACE_KEY;
				printf(UARTA1,"%c",temp);
				j--;
			}
			else
			{
				UART_Send(uartx,BELL_KEY);
			}
		}
		else if(getline_data == ENTER_KEY)
		{
			if(j>(length-1))
			{
				for(i=0;i<length;i++)
				{
					dummy[i] = dummy[i] - 0x30;
					if((dummy[i] >= 0x10) && (dummy[i] <= 0x15))
					{
						dummy[i] = dummy[i] - 6;
					}
				}
				for(i=length;i>0;i--)
				{
					c = 1;
					for(k=0;k<(i-1);k++)
					{
						b = 16;
						c = c*b;
					}
					str_ad += (dummy[length-i]*c);
				}
				return str_ad;
			}
		}
		else if((getline_data >= 0x30) && (getline_data <= 0x46))
		{
			if(j<length)
			{
				s[j] = getline_data;
				UART_Send(UARTA1,s[j]);
				if((s[j] >= 0x41) && (s[j] <= 0x46))
				{
					s[j] = s[j]-1;
				}
				dummy[j] = s[j];
				j++;
			}
		}
		else if(j>length)
		{
			UART_Send(uartx,BELL_KEY);
			if(getline_data == ENTER_KEY)
			{
				return j;
			}
		}
		else
		{
			UART_Send(uartx,BELL_KEY);
		}
	}
}

/***********************************************************************************************//**
* @brief        		Take data of variable length of DECIMAL format from UART Port Selected.
* @param[in]        	UART Module(UARTA0,UARTA1) , Character Array , LENGTH , TRANSFER BLOCK TYPE.
* @return           	Received Data will be returned in DECIMAL format to character array.
***************************************************************************************************/
unsigned int getline_dec(UartId_e uartx,char s[10],unsigned int length,TRANSFER_BLOCK_Type uartm)
{
	unsigned char dummy[10]={0};
	unsigned int j = 0,temp,str_ad=0,i,b=0,c=0,k;
	unsigned int getline_data;
	while(1)
	{
		getline_data = getche(uartx,uartm);
		if(getline_data == BACKSPACE_KEY)
		{
			if(j>0)
			{
				temp = BACKSPACE_KEY;
				printf(UARTA1,"%c",temp);
				temp = ' ';
				printf(UARTA1,"%c",temp);
				temp = BACKSPACE_KEY;
				printf(UARTA1,"%c",temp);
				j--;
			}
			else
			{
				UART_Send(uartx,BELL_KEY);
			}
		}
		else if(getline_data == ENTER_KEY)
		{
			if(j>(length-1))
			{
				for(i=0;i<length;i++)
				{
					dummy[i] = dummy[i] - 0x30;
				}

				for(i=length;i>0;i--)
				{
					c = 1;
					for(k=0;k<(i-1);k++)
					{
						c = c*10;
					}
					b = (dummy[length-i]*c);
					str_ad = str_ad + b;
				}
				return str_ad;
			}
		}
		else if((getline_data >= 0x30) && (getline_data <= 0x46))
		{
			if(j<length)
			{
				s[j] = getline_data;
				UART_Send(UARTA1,s[j]);
				dummy[j] = s[j];
				j++;
			}
		}
		else if(j>length)
		{
			UART_Send(uartx,BELL_KEY);
			if(getline_data == ENTER_KEY)
			{
				return j;
			}
		}
		else
		{
			UART_Send(uartx,BELL_KEY);
		}
	}
}
//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
